src/InformationRegisters/КотировкиЦБ/КотировкиЦБ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КотировкиЦБ</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>ЦенаЗакрытия</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЦенаОткрытия</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЦенаМаксимум</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЦенаМинимум</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Объем</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>18</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОбъемРубли</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>18</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НКД</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СделокКоличество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЦенаПоследняя</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ЦБ</name>
    <type>
      <types>CatalogRef.Облигации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/CommonModules/БондОбщий/Module.bsl
#Область ПрограммныйИнтерфейс

// Получение ссылки на тикер на сервере биржи
// 
// Параметры:
//  SECID - Строка - SECID тикера
//
// Возвращаемое значение:
//  Строка - URL
Функция СсылкаНаТикер(SECID) Экспорт
	URL = СтрШаблон(
			"%1/%2.json?%3",
			"https://iss.moex.com/iss/securities",
			SECID,
			"iss.meta=off&iss.only=description,boards&primary_board=1&iss.json=extended"
		);
	Возврат URL;	
КонецФункции

// Загрузка данных тикера (и акции и etf и облигации) с MOEX.
// 
// Параметры:
//  SECID - Строка - SECID тикера
//  ЭлементОбъект - СправочникОбъект - Текущий элемент справочника
Процедура ЗагрузитьТикерС_MOEX(SECID, ЭлементОбъект) Экспорт
	Тикер = ?(SECID=Неопределено, ЭлементОбъект.SECID, SECID);
	
//	URL = СтрШаблон(
//			"%1/%2.json?%3",
//			"https://iss.moex.com/iss/securities",
//			Тикер,
//			"iss.meta=off&iss.only=description,boards&primary_board=1&iss.json=extended"
//		);
	URL = СсылкаНаТикер(Тикер);

	ПараметрыПреобразованияJSON = Новый Структура("ПрочитатьВСоответствие", Ложь);
	ДополнительныеПараметры = Новый Структура("ПараметрыПреобразованияJSON", ПараметрыПреобразованияJSON);
	
	Ответ = КоннекторHTTP.GetJson(URL,,ДополнительныеПараметры);
	
	ТелоОтвета = Ответ[1];
	РеквизитыОбъекта = ЭлементОбъект.Метаданные().Реквизиты; 
	
	Если НЕ ТелоОтвета.Свойство("description") ИЛИ ТелоОтвета.description.Количество() = 0 Тогда
		ВызватьИсключение НСтр("ru='Ошибка получения данных с биржи. Тикер не найден'");
	КонецЕсли;
	
	ОчиститьОбъект(ЭлементОбъект);
	
	Для Каждого эл Из ТелоОтвета.description Цикл
		Если РеквизитыОбъекта.Найти(эл.name) = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Если эл.type = "date" Тогда
			ЭлементОбъект[эл.name] = ПрочитатьДатуJSON(эл.value, ФорматДатыJSON.ISO);
		ИначеЕсли эл.type = "boolean" Тогда
			ЭлементОбъект[эл.name] = ?(эл.value = "1", Истина, Ложь);		
		Иначе
			ЭлементОбъект[эл.name] = эл.value;
		КонецЕсли;
	КонецЦикла;
	ЭлементОбъект.Наименование = ЭлементОбъект.NAME;
	
	ЭлементОбъект.BOARDID = ТелоОтвета.boards[0].boardid;	
КонецПроцедуры

// Загрузка исторических котировок ценной бумаги с MOEX
// 
// Параметры:
//  НачалоПериода - Дата - Начальная дата периода
//  ОкончаниеПериода - Дата - Конечная дата периода
//  Тикер - СправочникСсылка.Облигации - Ссылка на элемент справочника Облигации
Процедура ЗагрузитьКотировкиЦБ(НачалоПериода, ОкончаниеПериода, Тикер) Экспорт
	
	Если НЕ ЗначениеЗаполнено(Тикер) Тогда
		Возврат;
	КонецЕсли;
	
	SECID = Тикер.SECID;
	
	Если НЕ ЗначениеЗаполнено(SECID) Тогда
		Возврат;
	КонецЕсли;
	
	ДатаНач = Формат(НачалоПериода, "ДФ=yyyy-MM-dd");
	ДатаКон = Формат(ОкончаниеПериода, "ДФ=yyyy-MM-dd");
	
	ПараметрыПреобразованияJSON = Новый Структура("ПрочитатьВСоответствие", Истина);
	ДополнительныеПараметры = Новый Структура("ПараметрыПреобразованияJSON", ПараметрыПреобразованияJSON);
	
	// Цикл для загрузки всех страниц данных (пагинация через cursor)
	Старт = 0;
	ЕстьДанные = Истина;
	
	Пока ЕстьДанные Цикл
		
		URL = СтрШаблон(
			"https://iss.moex.com/iss/history/engines/stock/markets/bonds/securities/%1.json?from=%2&till=%3&start=%4&iss.meta=off&iss.json=extended",
			SECID,
			ДатаНач,
			ДатаКон,
			Старт
		);
		
		Ответ = КоннекторHTTP.GetJson(URL,, ДополнительныеПараметры);
		ТелоОтвета = Ответ[1];
		
		Если ТелоОтвета["history"] = Неопределено ИЛИ ТелоОтвета["history"].Количество() = 0 Тогда
			Прервать;
		КонецЕсли;
		
		// Загрузка котировок в регистр сведений
		Для Каждого Строка Из ТелоОтвета["history"] Цикл
			ЗаписатьКотировкуВРегистр(Строка, Тикер);
		КонецЦикла;
		
		// Проверка cursor для определения необходимости загрузки следующей страницы
		СледующийСтарт = ПолучитьСледующийИндексИзКурсора(ТелоОтвета);
		
		Если СледующийСтарт <> Неопределено Тогда
			Старт = СледующийСтарт;
		Иначе
			ЕстьДанные = Ложь;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры


#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Получить индекс следующей страницы из cursor ответа MOEX
// 
// Параметры:
//  ТелоОтвета - Соответствие - Тело ответа от MOEX API
// 
// Возвращаемое значение:
//  Число, Неопределено - Индекс начала следующей страницы или Неопределено, если данных больше нет
Функция ПолучитьСледующийИндексИзКурсора(ТелоОтвета)
	
	Если ТелоОтвета["history.cursor"] = Неопределено ИЛИ ТелоОтвета["history.cursor"].Количество() = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ИнфоКурсор = ТелоОтвета["history.cursor"][0];
	ТекущийИндекс = Число(ИнфоКурсор["INDEX"]);
	РазмерСтраницы = Число(ИнфоКурсор["PAGESIZE"]);
	ВсегоЗаписей = Число(ИнфоКурсор["TOTAL"]);
	
	Если ТекущийИндекс + РазмерСтраницы < ВсегоЗаписей Тогда
		Возврат ТекущийИндекс + РазмерСтраницы;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

// Записать одну котировку в регистр сведений КотировкиЦБ
// 
// Параметры:
//  СтрокаДанных - Соответствие - Строка данных котировки из ответа MOEX
//  Тикер - СправочникСсылка.Облигации - Ссылка на облигацию
Процедура ЗаписатьКотировкуВРегистр(СтрокаДанных, Тикер)
	
	Если НЕ ЗначениеЗаполнено(СтрокаДанных["TRADEDATE"]) Тогда
		Возврат;
	КонецЕсли;
	
	ДатаЗаписи = ПрочитатьДатуJSON(СтрокаДанных["TRADEDATE"], ФорматДатыJSON.ISO);
	
	НаборЗаписей = РегистрыСведений.КотировкиЦБ.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Период.Установить(ДатаЗаписи);
	НаборЗаписей.Отбор.ЦБ.Установить(Тикер);
	
	Запись = НаборЗаписей.Добавить();
	Запись.Период = ДатаЗаписи;
	Запись.ЦБ = Тикер;
	
	// Заполнение ресурсов регистра из данных MOEX
	ЗаполнитьЧисловоеПолеИзJSON(СтрокаДанных, "CLOSE", Запись, "ЦенаЗакрытия");
	ЗаполнитьЧисловоеПолеИзJSON(СтрокаДанных, "OPEN", Запись, "ЦенаОткрытия");
	ЗаполнитьЧисловоеПолеИзJSON(СтрокаДанных, "HIGH", Запись, "ЦенаМаксимум");
	ЗаполнитьЧисловоеПолеИзJSON(СтрокаДанных, "LOW", Запись, "ЦенаМинимум");
	ЗаполнитьЧисловоеПолеИзJSON(СтрокаДанных, "VOLUME", Запись, "Объем");
	ЗаполнитьЧисловоеПолеИзJSON(СтрокаДанных, "VALUE", Запись, "ОбъемРубли");
	ЗаполнитьЧисловоеПолеИзJSON(СтрокаДанных, "ACCINT", Запись, "НКД");
	ЗаполнитьЧисловоеПолеИзJSON(СтрокаДанных, "NUMTRADES", Запись, "СделокКоличество");
	ЗаполнитьЧисловоеПолеИзJSON(СтрокаДанных, "LEGALCLOSEPRICE", Запись, "ЦенаПоследняя");
	
	Попытка
		НаборЗаписей.Записать(Истина);
	Исключение
		ТекстОшибки = ОписаниеОшибки();
		ЗаписьЖурналаРегистрации(
			НСтр("ru='Загрузка котировок'"),
			УровеньЖурналаРегистрации.Ошибка,
			,
			Тикер,
			СтрШаблон(НСтр("ru='Ошибка записи котировок за %1: %2'"), ДатаЗаписи, ТекстОшибки)
		);
	КонецПопытки;
	
КонецПроцедуры

// Заполнить числовое поле из JSON если значение существует
// 
// Параметры:
//  СтрокаJSON - Соответствие - Строка данных JSON
//  ИмяПоляJSON - Строка - Имя поля в JSON
//  ЗаписьРегистра - RegisterRecord.КотировкиЦБ - Запись регистра
//  ИмяПоляРегистра - Строка - Имя поля в регистре
Процедура ЗаполнитьЧисловоеПолеИзJSON(СтрокаJSON, ИмяПоляJSON, ЗаписьРегистра, ИмяПоляРегистра)
	Значение = СтрокаJSON.Получить(ИмяПоляJSON);
	Если Значение <> Неопределено И ЗначениеЗаполнено(Значение) Тогда
		ЗаписьРегистра[ИмяПоляРегистра] = Число(Значение);
	КонецЕсли;
КонецПроцедуры

// Очистить значения всех реквизитов элемента справочника
// 
// Параметры:
//  ЭлементОбъект - СправочникОбъект - Элемент справочника
Процедура ОчиститьОбъект(ЭлементОбъект)
	РеквизитыОбъекта = ЭлементОбъект.Метаданные().Реквизиты;
	Для Каждого Реквизит Из РеквизитыОбъекта Цикл
		ЭлементОбъект[Реквизит.Имя] = Неопределено;		
	КонецЦикла; 
	Для Каждого ТЧ Из ЭлементОбъект.Метаданные().ТабличныеЧасти Цикл
		ЭлементОбъект[ТЧ.Имя].Очистить();
	КонецЦикла;
КонецПроцедуры
#КонецОбласти
